swak4foam/Examples/other/counterFlowFlame2DInitialized/constant/reactions.oldFormat
species
(
    O2
    H2O
    CH4
    CO2
    N2
);

reactions
(
    irreversibleArrheniusReaction
    CH4 + 2O2 = CO2 + 2H2O
    (5.2e16 0  14906)
);